abjure
abrogate
abstain
acerbic
acrimony
acumen
adulterate
adumbrate
advocate
alacrity
ameliorate
anathema
anomaly
antipathy
apathy
approbation
arrogate
ascetic
aspersion
assiduous
assuage
audacious
blandish
bolster
boon
brusque
buffet
burnish
buttress
cacophony
cajole
calumny
capricious
clemency
cogent
concomitant
conflagration
contrite
conundrum
corroborate
credulity
cupidity
cursory
decry
defile
deleterious
demure
deprecate
deride
desecrate
desiccate
desiccated
diaphanous
diffident
discursive
dissemble
dissonance
dither
ebullient
effrontery
effulgent
egregious
enervate
engender
enigma
ephemeral
equivocal
erudite
eschew
eulogy
evanescent
evince
exculpate
execrable
exigent
expiate
expunge
extant
extol
fallacious
fastidious
fatuous
fecund
feral
fervid
fetid
florid
fractious
garrulous
grandiloquence
gregarious
gullible
hackneyed
hapless
harangue
hegemony
homogenous
iconoclast
ignominious
impassive
imperious
impertinent
impervious
impetuous
impinge
implacable
impudent
inchoate
incontrovertible
indefatigable
ineffable
inexorable
ingenuous
inimical
iniquity
insidious
intransigent
inure
invective
inveterate
jubilant
juxtaposition
laconic
languid
largess
latent
laudable
legerdemain
lethargic
licentious
limpid
loquacious
lucid
maelstrom
magnanimous
malediction
malevolent
malleable
manifold
maudlin
mawkish
mendacious
mercurial
misanthrope
mitigate
modicum
morass
multifarious
munificence
myriad
nadir
nascent
nefarious
neophyte
obdurate
obfuscate
oblique
obsequious
obstreperous
obtuse
odious
officious
opaque
opulent
ostensible
ostentation
palliate
pallid
panacea
paradox
paragon
pariah
parsimony
pathos
paucity
pedant
pejorative
pellucid
penurious
perfidious
perfunctory
pernicious
perspicacity
pertinacious
petulance
philanthropic
pithy
placate
platitude
plethora
polemic
portent
pragmatic
precipitate
precocious
prescient
prevaricate
primeval
probity
proclivity
prodigal
promulgate
propensity
propitious
propriety
prosaic
proscribe
protean
prurient
puerile
pugnacious
pulchritude
punctilious
quagmire
querulous
quixotic
rancor
rebuke
recalcitrant
rectitude
replete
reprobate
reprove
repudiate
rescind
restive
ribald
rife
ruse
sacrosanct
sagacity
salient
sanctimonious
sanguine
scurrilous
serendipity
servile
solicitous
solipsistic
somnolent
spurious
staid
stolid
stupefy
surfeit
surmise
surreptitious
sycophant
tacit
taciturn
tantamount
temerity
tenuous
timorous
torpid
tractable
transient
transmute
trenchant
truculent
turgid
turpitude
ubiquitous
umbrage
unctuous
undulate
upbraid
usurp
vacillate
vacuous
vapid
variegated
venerate
veracity
verdant
vex
vicarious
vicissitude
vilify
viscous
vitriolic
vituperate
volatile
wanton
waver
winsome
wistful
wizened
zeal
zenith
zephyr